# Pandas

Pandas is a Python library.
Pandas stands for Panel Data
Pandas is used to analyze data.
Dataframe & Series are used.
Visualization is possible using other libraries.

<img src="mo.png">

#import pandas

In [6]:

import pandas as pd  #pd is alias

In [7]:
import numpy as np

# Series

Series in simple words means a column.

In [5]:
pd.Series([1,2,3])

0    1
1    2
2    3
dtype: int64

In [8]:
pd.Series([1,2,3],index=["one","two","three"])  #giving artificial indices

one      1
two      2
three    3
dtype: int64

In [14]:
l=[2,3,6,8]
l=pd.Series(l)
l

0    2
1    3
2    6
3    8
dtype: int64

# Operations

In [16]:
l.sum()

19

In [17]:
l.count()

4

In [18]:
l.min()

2

In [19]:
l.max()

8

In [20]:
l.mean()

4.75

In [21]:
l.ndim  #dimensions

1

In [22]:
l.argmax()  #max(count of elements)

3

In [23]:
l.argmin()

0

# Indexing

loc and iloc are used

iloc can take -ve indexing and used for orignal index
loc cannot take -ve and used for artificial indexes

In [28]:
l

0    2
1    3
2    6
3    8
dtype: int64

In [26]:
l.iloc[1]

3

In [27]:
l.iloc[-1]

2

In [31]:
l.loc[2]

6

In [32]:
l.loc[0:2]

0    2
1    3
2    6
dtype: int64

# Other terminologies

In [34]:
m=pd.Series([9,10,11])
l.append(m)

0     2
1     3
2     6
3     8
0     9
1    10
2    11
dtype: int64

In [35]:
l.rank()  #least gets 1st rank

0    1.0
1    2.0
2    3.0
3    4.0
dtype: float64

In [ ]:
#rank methods
dense       not skip a num 3-1rank 3-1rank 4-2rank
min  3+4     3
max   3+4    4
avg  3+4    3.5
first

# DataFrames

DataFrames are tabular data which has information stored in table like structure we can import various datasets in any format
as excel,csv,html etc

In [ ]:
#In numpy float was the main dtype here object comes into picture

In [37]:
df=pd.DataFrame([1,2,4,5])
df

   0
0  1
1  2
2  4
3  5

In [38]:
df=pd.DataFrame([1,2,4,5],columns=["col1"])  #naming columns
df

   col1
0     1
1     2
2     4
3     5

In [68]:
df=pd.DataFrame({"col1":[3,4],"col2":["three","four"]},index=["00","11"])
df

    col1   col2
00     3  three
11     4   four

# Delete a row or a column

In [71]:
df.drop("col1",axis=1) #col deletion

     col2
00  three
11   four

In [75]:
df

     col2
00  three
11   four

In [76]:
df.drop("col2",axis=1,inplace=True) #permanent deletion
df

Empty DataFrame
Columns: []
Index: [00, 11]

In [ ]:
df.drop([0],axis=0) #first row

Insert

In [81]:
mo=["moh","avi"]
df.insert(0,"name",value=mo)
df

   name  roll
00  moh     1
11  avi     2

numerical and categorial data are types of data in dfs

# Counting specific categories

In [82]:
f = pd.DataFrame([['Emma Larter',3200],['Mia Junior',4500],['Sophia Depp',3600],['James Smith',5596]],columns=["Name","Salary"])
f

          Name  Salary
0  Emma Larter    3200
1   Mia Junior    4500
2  Sophia Depp    3600
3  James Smith    5596

In [83]:
f.value_counts()

Name         Salary
Emma Larter  3200      1
James Smith  5596      1
Mia Junior   4500      1
Sophia Depp  3600      1
dtype: int64

# Sort

In [86]:
f.sort_values("Salary")

          Name  Salary
0  Emma Larter    3200
2  Sophia Depp    3600
1   Mia Junior    4500
3  James Smith    5596

In [ ]:
##b.sort_values(by=["Store","Sales"],ascending=[True,False])

In [87]:
f.sort_index()

          Name  Salary
0  Emma Larter    3200
1   Mia Junior    4500
2  Sophia Depp    3600
3  James Smith    5596

create a  new column in dataframe

In [121]:
f["new_column"]=0
f

          Name  Salary  new  new_column
0  Emma Larter    3200    0           0
1   Mia Junior    4500    0           0
2  Sophia Depp    3600    0           0
3  James Smith    5596    0           0

# Concat Merge Append Join

# data alignment

In [89]:
 #Nan not a number if you do np.nan it takes float values

In [91]:

f11=[(101,"Apple","iPhone"),
    (102,"Canon","DSLR"),
    (103,"Samsung","SmartPhone"),
    (104,"Nikon","DSLR"),
    (105,"Sony","SmartTV")]

f11=pd.DataFrame(f11,columns=["ID","Brand","Product"])
f11

    ID    Brand     Product
0  101    Apple      iPhone
1  102    Canon        DSLR
2  103  Samsung  SmartPhone
3  104    Nikon        DSLR
4  105     Sony     SmartTV

In [92]:
f12=[(101,"Apple",234),
    (102,"Canon",344),
    (103,"Samsung",345),
    (104,"Nikon",262),
    (105,"Sony",356)]

f12=pd.DataFrame(f12,columns=["ID","Brand","Quantity_sold"])
f12

    ID    Brand  Quantity_sold
0  101    Apple            234
1  102    Canon            344
2  103  Samsung            345
3  104    Nikon            262
4  105     Sony            356

In [93]:
 #append  #only same col is present
f11.append(f12,ignore_index=True)

    ID    Brand     Product  Quantity_sold
0  101    Apple      iPhone            NaN
1  102    Canon        DSLR            NaN
2  103  Samsung  SmartPhone            NaN
3  104    Nikon        DSLR            NaN
4  105     Sony     SmartTV            NaN
5  101    Apple         NaN          234.0
6  102    Canon         NaN          344.0
7  103  Samsung         NaN          345.0
8  104    Nikon         NaN          262.0
9  105     Sony         NaN          356.0

In [99]:
#outer
#left
#right
#inner
f11.merge(f12,on=["Brand","ID"],how="outer")

    ID    Brand     Product  Quantity_sold
0  101    Apple      iPhone            234
1  102    Canon        DSLR            344
2  103  Samsung  SmartPhone            345
3  104    Nikon        DSLR            262
4  105     Sony     SmartTV            356

In [100]:
pd.concat([f11,f12])

    ID    Brand     Product  Quantity_sold
0  101    Apple      iPhone            NaN
1  102    Canon        DSLR            NaN
2  103  Samsung  SmartPhone            NaN
3  104    Nikon        DSLR            NaN
4  105     Sony     SmartTV            NaN
0  101    Apple         NaN          234.0
1  102    Canon         NaN          344.0
2  103  Samsung         NaN          345.0
3  104    Nikon         NaN          262.0
4  105     Sony         NaN          356.0

In [101]:
f11.join(f12.set_index(["Brand",'ID']),on=(["Brand",'ID']),how="left")

#join 
#left right  inner outer

    ID    Brand     Product  Quantity_sold
0  101    Apple      iPhone            234
1  102    Canon        DSLR            344
2  103  Samsung  SmartPhone            345
3  104    Nikon        DSLR            262
4  105     Sony     SmartTV            356

# Deleting data duplicates based on rows and cols

In [103]:
df_employee = [('John', 3400, 'Sydeny'),
            ('Robert', 3000, 'Chicago'),
            ('Aadi', 1600, 'New York'),
            ('Robert', 3000, 'Chicago'),
            ('Robert', 3000, 'Chicago'),
            ('Robert', 3000, 'Texas'),
            ('Aadi', 4000, 'London'),
            ('Sachin', 3000, 'Chicago')]
 
df=pd.DataFrame(df_employee,columns=["Name","Salary","City"])
df

     Name  Salary      City
0    John    3400    Sydeny
1  Robert    3000   Chicago
2    Aadi    1600  New York
3  Robert    3000   Chicago
4  Robert    3000   Chicago
5  Robert    3000     Texas
6    Aadi    4000    London
7  Sachin    3000   Chicago

In [104]:
df.drop_duplicates() #same rows

     Name  Salary      City
0    John    3400    Sydeny
1  Robert    3000   Chicago
2    Aadi    1600  New York
5  Robert    3000     Texas
6    Aadi    4000    London
7  Sachin    3000   Chicago

In [105]:
df.drop_duplicates(["Salary"]) #based on single col or cols

     Name  Salary      City
0    John    3400    Sydeny
1  Robert    3000   Chicago
2    Aadi    1600  New York
6    Aadi    4000    London

In [108]:
df.drop("Salary",axis=1) #drop entire column #inplace=True

     Name      City
0    John    Sydeny
1  Robert   Chicago
2    Aadi  New York
3  Robert   Chicago
4  Robert   Chicago
5  Robert     Texas
6    Aadi    London
7  Sachin   Chicago

In [112]:
df.drop_duplicates(["Salary"],keep="first") #first

     Name  Salary      City
0    John    3400    Sydeny
1  Robert    3000   Chicago
2    Aadi    1600  New York
6    Aadi    4000    London

# Groupby and Pivot  (whenever we see a word each use groupby) using agg func mean max min sum count

In [113]:
import pandas as pd
a={'Store': list('ABACDADACB'), 'Location': 'Mumbai Pune Hyderabad Mumbai Pune Delhi Hyderabad Pune Mumbai Pune'.split(),   'Sales': [40000,45000,50000,90000,89000,87000,85000,78000,89000,70000]}
b=pd.DataFrame(a)
b

  Store   Location  Sales
0     A     Mumbai  40000
1     B       Pune  45000
2     A  Hyderabad  50000
3     C     Mumbai  90000
4     D       Pune  89000
5     A      Delhi  87000
6     D  Hyderabad  85000
7     A       Pune  78000
8     C     Mumbai  89000
9     B       Pune  70000

In [114]:
pd.pivot_table(b, columns="Store", values="Sales", aggfunc="mean")

Store      A      B      C      D
Sales  63750  57500  89500  87000

In [122]:
b.groupby("Store").mean()

       Sales
Store
A      63750
B      57500
C      89500
D      87000

In [123]:
b.groupby("Store").max()

      Location  Sales
Store
A         Pune  87000
B         Pune  70000
C       Mumbai  90000
D         Pune  89000

In [124]:
b.count()

Store       10
Location    10
Sales       10
dtype: int64

# Reading dataset from other sources

In [ ]:
df=pd.read_csv("file_name.csv")
df

In [ ]:
like this you can read various types of files in pandas like excel,html,etc

# Good to go pandas ! keep Learning  :)